# removing outliers using z score
- Z score denotes how many std deviation your datapoint is from the mean

In [4]:
import numpy as np
import pandas as pd
import seaborn as sns

In [6]:
df=pd.read_csv("height.csv",names=['gender','height'],skiprows=[0])
df.head()

  gender     height
0   Male  73.847017
1   Male  68.781904
2   Male  74.110105
3   Male  71.730978
4   Male  69.881796

In [8]:
df.height.describe()

count    10000.000000
mean        66.367560
std          3.847528
min         54.263133
25%         63.505620
50%         66.318070
75%         69.174262
max         78.998742
Name: height, dtype: float64

In [16]:
df_mean=df.height.mean()
df_mean

np.float64(66.367559754866)

In [18]:
std_dev=df.height.std()
std_dev

np.float64(3.847528120795573)

In [13]:
df['z_score']=(df.height-df.height.mean())/df.height.std()
df.head()

  gender     height   z_score
0   Male  73.847017  1.943964
1   Male  68.781904  0.627505
2   Male  74.110105  2.012343
3   Male  71.730978  1.393991
4   Male  69.881796  0.913375

In [19]:
# verify z score for data point 73.84
(73.847017-66.367559754866)/3.847528120795573

1.9439642831219734

In [20]:
df[df.z_score>3]

     gender     height   z_score
994    Male  78.095867  3.048271
1317   Male  78.462053  3.143445
2014   Male  78.998742  3.282934
3285   Male  78.528210  3.160640
3757   Male  78.621374  3.184854

In [22]:
df[df.z_score<-3]

      gender     height   z_score
6624  Female  54.616858 -3.054091
9285  Female  54.263133 -3.146027

In [24]:
# combine both the conditions to get total outliers
df[(df.z_score>3) | (df.z_score<-3)]

      gender     height   z_score
994     Male  78.095867  3.048271
1317    Male  78.462053  3.143445
2014    Male  78.998742  3.282934
3285    Male  78.528210  3.160640
3757    Male  78.621374  3.184854
6624  Female  54.616858 -3.054091
9285  Female  54.263133 -3.146027

In [26]:
df_no_outlier=df[(df.z_score>-3) & (df.z_score<3)]
df_no_outlier.shape

(9993, 3)

In [27]:
df_no_outlier.height.describe()

count    9993.000000
mean       66.363856
std         3.835511
min        54.873728
25%        63.505894
50%        66.317755
75%        69.169353
max        77.547186
Name: height, dtype: float64